/****************** DESCRIPTION *****************/

/**
 * Имя файла: HW_UART.h
 * ----------------------------------------------------------------------------|---------------------------------------|
 * Назначение: обмен данными через аппаратный интерфейс UART.
 * ----------------------------------------------------------------------------|---------------------------------------|
 * Примечания:
 */


/************ ДИРЕКТИВЫ ПРЕПРОЦЕССОРА ***********/

// Защита от повторного включения заголовочного файла.
#ifndef HW_UART_H
#define HW_UART_H


/*************** ПРОТОТИПЫ ФУНКЦИЙ **************/

uint32_t HW_UART_read_line(char *buf, uint32_t str_max_len, uint32_t conn_timeout, uint32_t read_slowdown);


#endif  // Завершающая директива защиты от повторного включения заголовочного файла.
